tap "caffix/amass"
tap "homebrew/bundle"

# Nix utilities
brew "aspell" # Check spelling
brew "bash"
brew "coreutils" # GNU
brew "curl"
brew "gnu-sed" # GNU
brew "gnu-tar" # GNU
brew "grep" # GNU
brew "htop"
brew "logrotate"
brew "netcat" # GNU
brew "p7zip" # 7z
brew "shfmt" # linting for bash scripts
brew "tree"
brew "watch" # Use instead of while true; do;
brew "wget" # GNU

# Cloud stuff
brew "awscli"
brew "helm"
cask "google-cloud-sdk"
# Used by AWS to connect to instances w/o SSH key
cask "session-manager-plugin"
brew "packer"
brew "terraform"
brew "terragrunt"

# Development tools and languages
brew "ansible"
cask "bloomrpc" # Tool for debugging GRPC
cask "docker"
brew "colordiff"
cask "insomnia" # Alternative to postman
brew "git"
brew "jq" # CLI tool to interact with JSON
brew "yq" # CLI tool to interact with YAML
brew "mysql-client"
#brew "node"
cask "postman" # Useful for API testing
brew "tmux"
cask "vagrant"
brew "vim"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
brew "yamllint"
cask "fig" # Terminal autocomplete

# Pipenv and pyenv with dependencies
brew "xz"
brew "pyenv"
brew "pipenv"

# Productivity utilities
cask "iterm2"
cask "scroll-reverser"
cask "rectangle" # Keyboard shortcuts for modifying the screen layout

# Web browsers
cask "firefox"
cask "google-chrome"
cask "chromium"

# Chat apps
cask "signal"
cask "slack"
cask "discord"
cask "messenger"

# Miscellaneous
brew "lastpass-cli"
cask "robo-3t" # Useful for mongo stuff
cask "spotify"

# Security tools
brew "amass" # Great recon tool
cask "blockblock" # Monitor for persistent components
brew "exiftool" # Interact with and manipulate metadata
#brew "exploitdb"
brew "findomain" # Find new domains associated with a target
cask "knockknock" # Notification when a persistent component is added
cask "netiquette" # Network monitor
# cask "oversight" # Notify when mic or webcam are activated
brew "spoof-mac" # MAC address spoofing
brew "sqlmap"
brew "nmap"
brew "pdfgrep" # Useful for finding things in pdfs
cask "wireshark"

# Android security tools
brew "apktool"
brew "jadx" # Dex to java decompiler - used for android security work
