tap "caffix/amass"
tap "homebrew/bundle"

# Nix utilities
brew "bash"
brew "coreutils" # GNU
brew "gnu-sed" # GNU
brew "grep" # GNU
brew "htop"
brew "logrotate"
brew "netcat" # GNU
brew "tree"
brew "unrar"
brew "watch" # Use instead of while true; do;
brew "wget" # GNU

# Cloud stuff
brew "awscli"
brew "packer"
brew "terraform"

# Development tools and languages
brew "ansible"
cask "bloomrpc" # Tool for debugging GRPC
brew "colordiff"
brew "docker-compose"
cask "insomnia" # Alternative to postman
brew "go"
brew "git"
brew "macvim"
#brew "node"
cask "postman" # Useful for API testing
brew "jq"
brew "tmux"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"

# Pipenv and pyenv with dependencies
brew "xz"
brew "pyenv"
brew "pipenv"

# Productivity utilities
cask "iterm2"
cask "scroll-reverser"
cask "rectangle" # Keyboard shortcuts for modifying the screen layout

# Web browsers
cask "firefox"
cask "google-chrome"
cask "chromium"

# Chat apps
cask "signal"
cask "slack"

# Miscellaneous
brew "lastpass-cli"
cask "robo-3t" # Useful for mongo stuff
cask "spotify"

# Generic security tools
brew "amass" # Great recon tool
brew "exiftool" # Interact with and manipulate metadata
brew "exploitdb"
brew "findomain" # Find new domains associated with a target
brew "nmap"
brew "pdfgrep" # Useful for finding things in pdfs
cask "wireshark"

# Android security tools
brew "jadx" # Dex to java decompiler - used for android security work
brew "apktool"
