tap "homebrew/bundle"

### AWS ###
# CLI tool to interact with AWS services
brew "awscli"
# Incredibly useful tool to assume roles in AWS
brew "awsume"
# Used by AWS to connect to instances without SSH key
cask "session-manager-plugin"

### Google Cloud ###
# Google Cloud SDK provides tools for interacting with Google Cloud services
cask "google-cloud-sdk"

### *nix Utilities ###
# Check spelling programmatically
brew "aspell"
brew "bash"
brew "bash-completion@2"
# GNU core utilities
brew "coreutils"
brew "curl"
# Command-line fuzzy finder
brew "fzf"
# GNU sed
brew "gnu-sed"
# GNU tar: Free software for archiving
brew "gnu-tar"
# GNU grep: Free software for text search
brew "grep"
# logrotate: Simplifies the administration of multiple log files
brew "logrotate"
# GNU netcat: networking utility for reading from and writing to network connections
brew "netcat"
# 7z: File archiver with high compression ratio
brew "p7zip"
# htop: An interactive process viewer for Unix
brew "htop"
# Linting for bash scripts
brew "shfmt"
# More linting for bash scripts
brew "shellcheck"
# For testing bash scripts
brew "bats-core"
# Useful utility for file exploration
brew "tree"
# Alternative to while true; do;
brew "watch"
# GNU wget
brew "wget"

### Cloud Agnostic Utilities ###
# These tools are used to build, change, and version infrastructure efficiently and safely across multiple providers
brew "packer"
brew "terraform"
brew "terraform-docs"
brew "terragrunt"
brew "tflint"
brew "serverless"

### Config Management ###
# Ansible: Provides enterprise-level solutions for IT automation
brew "ansible"
# Used to create and run tests for ansible
brew "molecule"

### Containers ###
# Docker: Enables developers to build and share applications through containers
cask "docker"
brew "helm"
# Lightweight utility to set up k3s
# on any local or remote VM.
brew "k3sup"
# brew "kubectl"
# Provides kubectx and kubens
brew "kubectx"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Create k8s test environments
brew "kind"

### General Development Tools ###
# Additional functionality for managing brew via Brewfile
tap 'rcmdnk/file'
# Test github actions locally
brew "act"
# Alfred: Boosts efficiency with hotkeys, text expansion and more
cask "alfred"
# Version manager that can handle multiple languages
brew "asdf"
brew "brew-file"
# BloomRPC: A GUI Client for GRPC Services
cask "bloomrpc"
brew "colordiff"
# Alternative to postman
cask "insomnia"
# iTerm2: Terminal emulator as a replacement for Apple's Terminal app
cask "iterm2"
# Terminal autocomplete
cask "fig"
# GitHub CLI
brew "gh"
brew "git"
# CLI tool to interact with JSON
brew "jq"
# CLI tool for the Mac App Store
# https://github.com/mas-cli/mas
brew "mas"
brew "mysql-client"
# Useful for API testing
cask "postman"
brew "pre-commit"
# Rectangle: Move and resize windows in macOS using keyboard shortcuts or snap areas
cask "rectangle"
# Useful for mongo stuff
cask "robo-3t"
cask "scroll-reverser"
brew "tmux"
cask "vagrant"
brew "vim"
cask "visual-studio-code"
# Used to run X11 applications on macOS
cask "xquartz"
brew "yamllint"
# CLI tool to interact with YAML
brew "yq"

### Android ###
# apktool: Tool for reverse engineering Android apk files
brew "apktool"
# Dex to java decompiler -
# used for android security work
brew "jadx"

# xz: General-purpose data compression software with high compression ratio
brew "xz"

### Web Browsers ###
# Chromium: Open-source web browser project from which Google Chrome draws its source code
cask "chromium"
cask "firefox"
cask "google-chrome"

### Chat Apps ###
cask "discord"
cask "signal"
cask "slack"

### Entertainment ###
cask "spotify"

### Security tools ###
# Great recon tool
tap "caffix/amass"
brew "amass"
# Checkov: Infrastructure as Code static code analysis tool
brew "checkov"
# Interact with and manipulate metadata
brew "exiftool"
# Exploit DB CLI - causes a lot of issues with AV and EDR, so it's disabled by default
#brew "exploitdb"
# Find new domains associated with a target
brew "findomain"
brew "gpg"
# Keeper Desktop Client
cask "keeper-password-manager"
# Notification when a persistent component is added
cask "knockknock"
# Useful for finding things in pdfs
brew "pdfgrep"
# Network monitor
cask "netiquette"
brew "nmap"
# Notify when mic or webcam are activated - can cause issues, so it's disabled by default
# cask "oversight"
# MAC address spoofing
brew "spoof-mac"
brew "sqlmap"
# Wireshark: capture packets
# If your list of available capture interfaces is empty
# (default macOS behavior), install ChmodBPF
cask "wireshark"
# One of the best static code analysis tools out there
brew "semgrep"
